{
    "bio":"I am a recent graduate from City, University of London that has completed my bachelor's degree in Computer Science. Throughout my studies I consistenly achieved above a first class grade for my modules and obtained 82.95% average for my entire degree. I have achieved a few awards with respect to my studies such as ('Outstanding Part 1 Student Award (Technical Stream)' for 'achieving an exceptionally high overall mark across their first year in the department'). I am currently looking for employment as a software developer.",
    "transferableSkills":[
            ["Problem Solving", "Problem solving is an integral part of computer science and software development. To aid me I usually make use of a whiteboard to think through the problem. An example of this is in my recent final year project in whichI had to figure out a way to correctly calculate the volume encompased by nodes. I drew a couple of configurations on the whiteboard and analysed the configurations and managed to figure out an algorithm for determining node shapes which was used to calculate the volume."],
            ["Communication and Team Working", "Whilst working on the team project in the second year I took the role as the lead programmer, I had to actively communicate with the rest of my team and the other programmers to divide work and help others as needed, to do this we set up a slack chat to communicate as well as setting up a GitHub repository for the project. As a result, we managed to achieve 76% overall for the module."],
            ["Time Management", "Time management is extremely important for individual and groups projects. To organise my work I create an overall plan for the project which has rought deadlines for key elements, and secondary plans for each of the elements to subdivide the workthroughout the weeks/months. I utilised this in my final project, at the start I created a Gantt chart for items such as research, design, implementation, testing, and analysis. At the end of each segment, I reviewed the chart to see if I was still on track andmade appropriate adjustments. I managed to complete the project in good time and achieved a first class grade."]],
    "technicalSkills":[
        {
            "Languages":["C++", "Java", "Javascript", "Python", "Haskell"],
            "Libraries": ["React", "OpenGL", "GLM", "Swing"],
            "Tools": ["Visual Studio", "SQLite", "Visual Paradigm", "Netbeans", "GIT"]
        }
    ],
    "qualifications":[
        {
            "Degree":[["Bsc Computer Science", "1st Class"]],
            "ALevel": [["Computer Science", "A"], ["Physics", "B"], ["Maths", "B"]]
        }
    ],
    "achievements":[
        {
            "achievements": ["3rd Place for Best Graphics in 3D Graphics Module","Outstanding Part 1 Student Award (Technical Stream) from City, University of London for 'achieving an exceptionally high overall mark across their first year in the department'"]
             
        }
    ]
}